[["UNK", 0], ["EOF", 1], ["empty", 2], ["self", 3], ["0", 4], ["None", 5], ["1", 6], ["True", 7], ["name", 8], ["False", 9], ["2", 10], ["path", 11], ["assertEqual", 12], ["x", 13], ["data", 14], ["value", 15], ["args", 16], ["os", 17], ["len", 18], ["result", 19], ["get", 20], ["i", 21], ["append", 22], ["id", 23], ["", 24], ["kwargs", 25], ["request", 26], ["key", 27], ["3", 28], ["__init__", 29], ["f", 30], ["np", 31], ["s", , 36], ["sys", 37], ["str", 38], ["type", 39], ["c", 40], ["url", 41], ["node", 42], ["isinstance", 43], ["p", 44], ["format", 45], ["max_length", 46], ["d", 47], ["e", 48], ["user", 49], ["r", 50], ["4", 51], ["blank", 52], ["_", 53], ["models", 54], ["obj", 55], ["-1", 56], ["context", 57], ["object", 58], ["y", 59], ["config", 60], ["cls", 61], ["b", 62], ["n", 63], ["v", 64], ["int", 65], ["text", 66], ["5", 67], ["msg", 68], ["client", 69], ["t", 70], ["objects", 71], ["k", 72], ["db", 73], ["options", 74], ["list", 75], ["line", 76], ["index", 77], ["time", 78], ["null", 79], ["m", 80], ["filename", 81], ["django.db.models.fields.CharField", 82], ["write", 83], ["params", 84], ["10", 85], ["res", 86], ["status", 87], ["item", 88], ["message", 89], ["datetime", 90], ["set", 91], ["super", 92], ["info", 93], ["__name__", 94], ["dict", 95], ["app", 96], ["error", 97], ["settings", 98], ["log", 99], ["split", 100], ["logging", 101], ["range", 102], ["parser", 103], ["assertTrue", 104], ["ValueError", 105], ["model", 106], ["instance", 107], ["re", 108], ["start", 109], ["other", 110], ["mock", 111], ["version", 112], ["logger", 113], ["values", 114], ["debug", 115], ["to", 116], ["test", 117], ["items", 118], ["size", 119], ["out", 120], ["headers", 121], ["json", 122], ["open", 123], ["query", 124], ["action", 125], ["Exception", 126], ["val", 127], ["body", 128], ["state", 129], ["update", 130], ["property", 131], ["unittest", 132], ["help", 133], ["count", 134], ["description", 135], ["add", 136], ["group", 137], ["title", 138], ["field", 139], ["create", 140], ["port", 141], ["env", 142], ["w", 143], ["fields", 144], ["ret", 145], ["session", 146], ["method", 147], ["shape", 148], ["output", 149], ["content", 150], ["6", 151], ["parent", 152], ["host", 153], ["row", 154], ["getattr", 155], ["close", 156], ["code", 157], ["read", 158], ["username", 159], ["foo", 160], ["target", 161], ["Meta", 162], ["cmd", 163], ["patch", 164], ["label", 165], ["event", 166], ["100", 167], ["primary_key", 168], ["keys", 169], ["TestCase", 170], ["filter", 171], ["token", 172], ["*", 173], ["l", 174], ["resp", 175], ["assertRaises", 176], ["match", 177], ["1.0", 178], ["utils", 179], ["8", 180], ["expected", 181], ["func", 182], ["tag", 183], ["file", 184], ["numpy", 185], ["copy", 186], ["prefix", 187], ["source", 188], ["0.0", 189], ["password", 190], ["hasattr", 191], ["arg", 192], ["j", 193], ["form", 194], ["module", 195], ["g", 196], ["\n", 197], ["run", 198], ["object_name", 199], ["return_value", 200], ["X", 201], ["all", 202], ["dtype", 203], ["A", 204], ["results", 205], ["pos", 206], ["array", 207], ["assertEquals", 208], ["table", 209], ["command", 210], ["end", 211], ["conn", 212], ["float", 213], ["stdout", 214], ["pop", 215], ["strip", 216], ["root", 217], ["random", 218], ["200", 219], ["/", 220], ["T", 221], ["connection", 222], ["mode", 223], ["api", 224], ["__future__", 225], ["server", 226], ["base", 227], ["replace", 228], ["save", 229], ["main", 230], ["project", 231], ["template", 232], ["req", 233], ["setUp", 234], ["string", 235], ["startswith", 236], ["environ", 237], ["view", 238], ["7", 239], ["z", 240], [" ", 241], ["timeout", 242], ["print", 243], ["exists", 244], ["h", 245], ["o", 246], ["__class__", 247], ["status_code", 248], ["dest", 249], ["TypeError", 250], ["op", 251], ["lower", 252], [".", 253], ["__main__", 254], ["image", 255], ["q", 256], ["task", 257], ["level", 258], ["argv", 259], ["domain", 260], ["doc", 261], ["u", 262], ["err", 263], ["attr", 264], ["ctx", 265], ["errors", 266], ["255", 267], ["width", 268], ["classmethod", 269], ["execute", 270], ["opts", 271], ["9", 272], ["length", 273], ["kw", 274], ["idx", 275], ["date", 276], ["pk", 277], ["uuid", 278], ["attrs", 279], ["django.db.models.fields.AutoField", 280], ["child", 281], ["stderr", 282], ["dirname", 283], ["20", 284], ["delete", 285], ["exception", 286], ["lines", 287], ["django.db.models.fields.related.ForeignKey", 288], ["email", 289], ["django.db.models.fields.BooleanField", 290], ["tuple", 291], ["offset", 292], ["User", 293], ["socket", 294], ["120", 295], ["entry", 296], ["service", 297], ["reverse", 298], ["max", 299], ["Constant", 300], ["CharField", 301], ["assert_equal", 302], ["resource", 303], ["callback", 304], ["now", 305], ["related_name", 306], ["assertFalse", 307], ["Column", 308], ["add_argument", 309], ["compile", 310], ["auth", 311], ["cursor", 312], ["post", 313], ["verbose", 314], ["ImportError", 315], ["flags", 316], ["element", 317], ["bar", 318], ["address", 319], ["stream", 320], ["header", 321], ["forms", 322], ["metadata", 323], ["uri", 324], ["remove", 325], ["six", 326], ["subprocess", 327], ["next", 328], ["NotImplementedError", 329], ["30", 330], ["exc", 331], ["map", 332], ["GET", 333], ["handler", 334], ["POST", 335], ["axis", 336], ["exit", 337], ["encode", 338], ["nodes", 339], ["extend", 340], ["setup", 341], ["util", 342], ["sum", 343], ["register", 344], ["B", 345], ["0.5", 346], ["find", 347], ["C", 348], ["django.db.models.fields.DateTimeField", 349], ["Mock", 350], ["files", 351], ["call", 352], ["min", 353], ["columns", 354], ["wx", 355], ["tags", 356], ["color", 357], ["cfg", 358], ["children", 359], ["height", 360], ["16", 361], ["encoding", 362], ["stop", 363], ["fn", 364], ["QtGui", 365], ["location", 366], ["50", 367], ["enumerate", 368], ["connect", 369], ["KeyError", 370], ["sorted", 371], ["driver", 372], ["unique", 373], ["space", 374], ["inst", 375], ["expr", 376], ["xrange", 377], ["input", 378], ["conf", 379], ["frame", 380], ["load", 381], ["comment", 382], ["content_type", 383], ["col", 384], ["dumps", 385], ["verbose_name", 386], ["page", 387], ["attributes", 388], ["src", 389], ["N", 390], ["current", 391], ["factory", 392], ["first", 393], ["StringIO", 394], ["required", 395], ["AttributeError", 396], ["protocol", 397], ["django.db.models.fields.TextField", 398], ["iteritems", 399], ["loads", 400], ["django.db.models.fields.IntegerField", 401], ["utf-8", 402], ["12", 403], ["staticmethod", 404], ["Q", 405], ["pytest", 406], ["admin", 407], ["link", 408], ["repr", 409], ["fp", 410], ["Model", 411], ["slug", 412], ["G", 413], ["decode", 414], ["widget", 415], ["render", 416], ["buf", 417], ["ctypes", 418], ["new", 419], ["types", 420], ["cache", 421], ["network", 422], ["search", 423], [",", 424], ["column", 425], ["http", 426], ["channel", 427], ["S", 428], ["names", 429], ["__file__", 430], ["sub", 431], ["insert", 432], ["eq_", 433], ["unicode", 434], ["df", 435], ["__str__", 436], ["record", 437], ["kind", 438], ["limit", 439], ["filters", 440], ["assert_called_once_with", 441], ["site", 442], ["11", 443], ["LOG", 444], ["rv", 445], ["namespace", 446], ["users", 447], ["meta", 448], ["fname", 449], ["sleep", 450], ["groups", 451], ["zip", 452], ["messages", 453], ["parts", 454], ["left", 455], ["getLogger", 456], ["queue", 457], ["schema", 458], ["cluster", 459], ["sa", 460], ["gf", 461], ["32", 462], ["parse", 463], ["-", 464], ["15", 465], ["store", 466], ["__repr__", 467], ["user_id", 468], ["ip", 469], ["function", 470], ["2.0", 471], ["__dict__", 472], ["stats", 473], ["warn", 474], ["container", 475], ["String", 476], ["job", 477], ["payload", 478], ["migrations", 479], ["dt", 480], ["math", 481], ["order", 482], ["contents", 483], ["extra", 484], ["plt", 485], ["pattern", 486], ["D", 487], [":", 488], ["db_index", 489], ["fd", 490], ["absolute_import", 491], ["lineno", 492], ["timestamp", 493], ["rows", 494], ["select", 495], ["kernel", 496], ["0.035", 497], ["step", 498], ["param", 499], ["properties", 500], ["option", 501], ["unicode_literals", 502], ["ForeignKey", 503], ["exp", 504], ["bool", 505], ["exceptions", 506], ["spec", 507], ["zeros", 508], ["sort", 509], ["abspath", 510], ["1000", 511], ["warnings", 512], ["warning", 513], ["check", 514], ["choices", 515], ["success", 516], ["author", 517], ["assertIn", 518], ["number", 519], ["reason", 520], ["platform", 521], ["owner", 522], ["commit", 523], ["constants", 524], ["0.1", 525], ["setattr", 526], ["_meta", 527], ["tokens", 528], ["num", 529], ["dir", 530], ["category", 531], ["endswith", 532], ["RuntimeError", 533], ["60", 534], ["manager", 535], ["send", 536], ["_id", 537], ["iprot", 538], ["builder", 539], ["fail", 540], ["parameters", 541], ["M", 542], ["ordering", 543], ["top", 544], ["profile", 545], ["style", 546], ["add_option", 547], ["oprot", 548], ["right", 549], ["events", 550], ["requests", 551], ["tree", 552], ["MagicMock", 553], ["desc", 554], ["mox", 555], ["year", 556], ["signal", 557], ["alpha", 558], ["collections", 559], ["html", 560], ["1024", 561], ["inputs", 562], ["handle", 563], ["transport", 564], ["reactor", 565], ["basename", 566], ["process", 567], ["struct", 568], ["64", 569], ["labels", 570], ["alias", 571], ["window", 572], ["hostname", 573], ["plugin", 574], ["opt", 575], ["mod", 576], [", ", 577], ["addr", 578], ["script", 579], ["modules", 580], ["img", 581], ["indent", 582], ["Name", 583], ["block", 584], ["var", 585], ["defaults", 586], ["raises", 587], ["outfile", 588], ["c_int", 589], ["traceback", 590], ["rule", 591], ["validate", 592], ["sock", 593], ["xml", 594], ["pid", 595], ["sql", 596], ["tempfile", 597], ["128", 598], ["shutil", 599], ["print_function", 600], ["raw", 601], ["entity", 602], ["put", 603], ["exc_info", 604], ["dot", 605], ["store_true", 606], ["swgpy.object", 607], ["stfName", 608], ["engine", 609], ["defer", 610], ["Integer", 611], ["attribute_template_id", 612], ["clear", 613], ["orm", 614], ["42", 615], ["setdefault", 616], ["route", 617], ["-2", 618], ["region", 619], ["graph", 620], ["ax", 621], ["ref", 622], ["loc", 623], ["theano", 624], ["subject", 625], ["stat", 626], ["ex", 627], ["Node", 628], ["threading", 629], ["queryset", 630], ["qs", 631], ["mask", 632], ["operator", 633], ["build", 634], ["tables", 635], ["sender", 636], ["timedelta", 637], ["L", 638], ["backend", 639], ["__all__", 640], ["F", 641], ["scope", 642], ["ast", 643], ["django.db", 644], ["package", 645], ["Y", 646], ["long", 647], ["section", 648], ["stack", 649], ["expect", 650], ["abs", 651], ["document", 652], ["skip", 653], ["position", 654], ["t1", 655], ["__version__", 656], ["DEBUG", 657], ["ext", 658], ["actual", 659], ["created", 660], ["pack", 661], ["pool", 662], ["unique_together", 663], ["flush", 664], ["buffer", 665], ["arguments", 666], ["directory", 667], ["R", 668], ["endpoint", 669], ["IOError", 670], ["upper", 671], ["login", 672], ["suite", 673], ["device", 674], ["urlparse", 675], ["release", 676], ["klass", 677], ["bytes", 678], ["scale", 679], ["total", 680], ["pi", 681], ["tb", 682], ["field_name", 683], ["help_text", 684], ["database", 685], ["testing", 686], ["diff", 687], ["ValidationError", 688], ["io", 689], ["mean", 690], ["word", 691], ["__call__", 692], ["language", 693], ["hash", 694], ["urllib", 695], ["views", 696], ["file_name", 697], ["__doc__", 698], ["role", 699], ["CONF", 700], ["sqrt", 701], ["paths", 702], ["lib", 703], ["errno", 704], ["common", 705], ["where", 706], ["prop", 707], ["ns", 708], ["redirect", 709], ["tearDown", 710], ["elem", 711], ["sep", 712], ["13", 713], ["system", 714], ["month", 715], ["pd", 716], ["14", 717], ["QtCore", 718], ["basestring", 719], ["part", 720], ["uid", 721], ["wait", 722], ["argparse", 723], ["tmp", 724], ["identifier", 725], ["Error", 726], ["cybox_common", 727], ["repo", 728], ["storage", 729], ["inspect", 730], ["usage", 731], ["metavar", 732], ["init", 733], ["collection", 734], ["exclude", 735], ["dataset", 736], ["order_by", 737], ["reader", 738], ["django", 739], ["cur", 740], ["symmetrical", 741], ["controller", 742], ["packages", 743], ["dist", 744], ["click", 745], ["W", 746], ["proxy", 747], ["show", 748], ["writer", 749], ["K", 750], ["rel", 751], ["40", 752], ["seq", 753], ["p1", 754], ["assert_", 755], ["division", 756], ["any", 757], ["scheme", 758], ["project_id", 759], ["locals", 760], ["datetime.datetime.now", 761], ["nullable", 762], ["django.db.models.fields.related.ManyToManyField", 763], ["ts", 764], ["core", 765], ["term", 766], ["AndReturn", 767], ["iter", 768], ["shell", 769], ["P", 770], ["include", 771], ["application", 772], ["pickle", 773], ["provider", 774], ["E", 775], ["day", 776], ["nx", 777], ["topic", 778], ["called", 779], ["I", 780], ["isfile", 781], ["django.conf", 782], ["last", 783], ["chunk", 784], ["volume", 785], ["extensions", 786], ["fmt", 787], ["images", 788], ["active", 789], ["24", 790], ["outputs", 791], ["runner", 792], ["points", 793], ["addCallback", 794], ["Migration", 795], ["django.db.models.fields.PositiveIntegerField", 796], ["loader", 797], ["side_effect", 798], ["glob", 799], ["ch", 800], ["tests", 801], ["80", 802], ["abc", 803], ["transaction", 804], ["gen", 805], ["cleaned_data", 806], ["PIPE", 807], ["astype", 808], ["registry", 809], ["TType", 810], ["transform", 811], ["actions", 812], ["parse_args", 813], ["suffix", 814], ["400", 815], ["OSError", 816], ["lock", 817], ["indices", 818], ["priority", 819], ["commands", 820], ["interval", 821], ["bind", 822], ["POINTER", 823], ["dim", 824], ["Gaffer", 825], ["local", 826], ["initial", 827], ["application/json", 828], ["flag", 829], ["targets", 830], ["sentinel", 831], ["256", 832], ["tenant_id", 833], ["serialize", 834], ["arr", 835], ["enabled", 836], ["salt", 837], ["locale", 838], ["OrderedDict", 839], ["isdir", 840], ["ftype", 841], ["ndim", 842], ["ids", 843], ["seconds", 844], ["account", 845], ["seed", 846], ["classes", 847], ["model_name", 848], ["25", 849], ["float32", 850], ["__salt__", 851], ["cols", 852], ["router", 853], ["delta", 854], ["has_key", 855], ["Image", 856], ["temp", 857], ["version_info", 858], ["depth", 859], ["reset", 860], ["IndexError", 861], ["500", 862], ["itertools", 863], ["days", 864], ["proc", 865], ["attribute", 866], ["amount", 867], ["assertIsInstance", 868], ["tensor", 869], ["getvalue", 870], ["template_name", 871], ["el", 872], ["_data", 873], ["pipeline", 874], ["choice", 875], ["arange", 876], ["pretty_print", 877], ["deepcopy", 878], ["counter", 879], ["case", 880], ["s1", 881], ["=", 882], ["cwd", 883], ["freq", 884], ["ds", 885], ["Foo", 886], ["statement", 887], ["sig", 888], ["httplib", 889], ["resources", 890], ["duration", 891], ["thread", 892], ["dump", 893], ["NA", 894], ["true", 895], ["plot", 896], ["Command", 897], ["app_label", 898], ["OK", 899], ["reshape", 900], ["Group", 901], ["product", 902], ["t2", 903], ["point", 904], ["__getitem__", 905], ["interface", 906], ["net", 907], ["changes", 908], ["rb", 909], ["handlers", 910], ["Request", 911], ["_name", 912], ["seek", 913], ["serializer", 914], ["stdin", 915], ["master", 916], ["functools", 917], ["grid", 918], ["score", 919], ["bucket", 920], ["instances", 921], ["strftime", 922], ["attrib", 923], ["db_table", 924], ["dev", 925], ["lwrite", 926], ["methods", 927], ["wrapper", 928], ["timezone", 929], ["entries", 930], ["tt", 931], ["file_path", 932], ["layout", 933], ["etree", 934], ["mapper", 935], ["lang", 936], ["found", 937], ["flavor", 938], ["sin", 939], ["fakes", 940], ["dst", 941], ["matches", 942], ["readline", 943], ["tmpdir", 944], ["404", 945], ["H", 946], ["scheduler", 947], ["start_time", 948], ["cb", 949], ["urllib2", 950], ["Field", 951], ["c_void_p", 952], ["first_name", 953], ["unit", 954], ["is_valid", 955], ["Event", 956], ["rng", 957], ["assert_raises", 958], ["Text", 959], ["one", 960], ["proto", 961], ["PhoneNumberDesc", 962], ["patterns", 963], ["filepath", 964], ["states", 965], ["assert_called_with", 966], ["IntegerField", 967], ["client_id", 968], ["symbol", 969], ["ones", 970], ["life", 971], ["name_", 972], ["using", 973], ["mapping", 974], ["rules", 975], ["ui", 976], ["weight", 977], ["Response", 978], ["V", 979], ["extension", 980], ["base64", 981], ["argtypes", 982], ["hashlib", 983], ["policy", 984], ["slice", 985], ["char", 986], ["fid", 987], ["nova", 988], ["second", 989], ["direction", 990], ["agent", 991], ["sources", 992], ["report", 993], ["urls", 994], ["dependencies", 995], ["globals", 996], ["ignore", 997], ["Popen", 998], ["clean", 999], ["bundle", 1000], ["zone", 1001]]32], ["default", 33], ["join", 34], ["a", 35], ["response"